/*
Дана область G. Точка X задана своими координатами. Определить, принадлежит ли точка X заданной области (включая границу).
Области начинаются в точке (2; 0) и (1; -1) и дальше идут вверх и вправо, вниз и вправо соответственно до бесконечности.
*/

#include <iostream>
using namespace std;

int main()
{
	double x, y;
	cin >> x >> y;
	if (x >= 2 && y >= 0 || x >= 1 && y <= -1) {
		cout << "Yes";
	}
	else {
		cout << "No";
	}
}
