/* 
Дан прямоугольник со сторонами a и b. Найдите его периметр.
*/

#include <iostream>
using namespace std;

int main()
{
	int a, b;
	cin >> a >> b;
	cout << (a + b) * 2;
}
