/* 
Арифметическая прогрессия — это последовательность чисел, в которой разность между двумя соседними элементами
постоянна. Например, последовательность 12,15,18,21,24,... является арифметической прогрессией, 12 — первый
член прогрессии, разность прогрессии равна 3. Ваша программа получит на вход первый член прогрессии a1, ее разность
d и число N. Она должна вычислить N-й член прогрессии.
*/

#include <iostream>
using namespace std;

int main()
{
	int a, b, c;
	cin >> a >> b >> c;
	for (int i = 0; i < c-1; i++)
	{
		a = a + b;
	}
	cout << a;
}
